Repository: biblibre/omeka-s-module-Quark
Catalog: documentation/locales/*/LC_MESSAGES/index.po
Languages: fr

source: `Quark`_ is a module for Omeka S that generates ARK identifiers for Omeka S resources, like `Ark`_.
fr: `Quark`_ est un module pour Omeka S qui génère des identifiants ARK pour les ressources Omeka S, comme `Ark`_.

source: Comparison with the Ark module
fr: Comparaison avec le module Ark

source: Unlike `Ark`_, Quark:
fr: Contrairement à `Ark`_, Quark:

source: does not need an external library,
fr: n'a pas besoin d'une librairie externe,

source: does not need ``dba`` PHP extension,
fr: n'a pas besoin de l'extension PHP ``dba``,

source: does not need a separate database file,
fr: n'a pas besoin d'un fichier de base de données séparé,

source: uses `UUID <https://fr.wikipedia.org/wiki/Universally_unique_identifier>`_ to generate unique identifiers
fr: utilise `UUID <https://fr.wikipedia.org/wiki/Universally_unique_identifier>`_ pour générer des identifiants uniques

source: has less configuration options
fr: a moins d'options de configuration

source: does not implement "inflections" (URLs that end with one or two question marks) yet
fr: n'implémente pas les "inflections" (les URLs qui se terminent par un ou deux points d'interrogation) pour le moment

source: Because it uses UUID, Quark should generate ARK identifiers faster that `Ark`_, especially as the number of resources grow.
fr: Parce qu'il utilise UUID, Quark devrait générer des identifiants ARK plus rapidement que `Ark`_, en particulier lorsque le nombre de ressources augmente.

source: See general end user documentation for `Installing a module <http://omeka.org/s/docs/user-manual/modules/#installing-modules>`_.
fr: Voir la documentation utilisateur générale pour `Installer un module <http://omeka.org/s/docs/user-manual/modules/#installing-modules>`_.
